# BarsTooSparseSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..BarsTooSparseSpacing Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BarsTooSparseSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BarsTooSparseSpacing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BarsTooSparseSpacing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace